restaurant/app/controllers/dishes_controller.rb

  def index
    dishes=Dish.all
---
SELECT "dishes".* FROM "dishes"

  def show
    dish=Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    dish=Dish.new(dish_params)
    if dish.save
---
INSERT INTO "dishes" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Chicken Sandwich"], ["description", "A delicious chicken sandwhich with lots of mayo."], ["created_at", "2018-12-18 14:37:59.852125"], ["updated_at", "2018-12-18 14:37:59.852125"]]

  def destroy
    dish=Dish.find(params[:id])
    dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 6]]

  def update
    dish=Dish.find(params[:id])
    if dish.update_attributes(dish_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "dishes" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["name", "Gregs Dish"], ["description", "It will be great"], ["updated_at", "2018-12-18 14:48:14.561105"], ["id", 5]]